FemDesign.Releases.MotionsPlasticLimits.#ctor
Parameterless constructor for serialization.

FemDesign.Releases.MotionsPlasticLimits.#ctor(System.Nullable{System.Double},System.Nullable{System.Double},System.Nullable{System.Double},System.Nullable{System.Double},System.Nullable{System.Double},System.Nullable{System.Double})
Define a new translations release plastic limit [kN/m or kN/m/m].
xNeg: Kx' compression. [kN/m or kN/m/m]. Default input null means no plastic limit.
xPos: Kx' tension. [kN/m or kN/m/m]. Default input null means no plastic limit.
yNeg: Ky' compression. [kN/m or kN/m/m]. Default input null means no plastic limit.
yPos: Ky' tension. [kN/m or kN/m/m]. Default input null means no plastic limit.
zNeg: Kz' compression. [kN/m or kN/m/m]. Default input null means no plastic limit.
zPos: Kz' tension. [kN/m or kN/m/m]. Default input null means no plastic limit.